000_РОЗНИЦА_ЦЕНТР/src/InformationRegisters/БиометрическиеДанные/БиометрическиеДанные.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиометрическиеДанные</name>
  <resources>
    <name>Биометрия</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/РаботаСБиометричекимиДанными/Module.bsl
Функция ПолучитьБиометриюСотрудника(ФизЛицо)  Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БиометрическиеДанные.ФизЛицо КАК ФизЛицо,
	               |	БиометрическиеДанные.Биометрия КАК Биометрия
	               |ИЗ
	               |	РегистрСведений.БиометрическиеДанные КАК БиометрическиеДанные
	               |ГДЕ
	               |	БиометрическиеДанные.ФизЛицо = &ФизЛицо"; 
	Запрос.УстановитьПараметр("ФизЛицо",ФизЛицо);
	Рез_ = Запрос.Выполнить().Выбрать();
	
	Если Рез_.Следующий() Тогда
		Возврат Рез_.Биометрия;
	Иначе
		Возврат "";
	КонецЕсли;
КонецФункции


Функция УстановитьБиометриюСотруднику(ФизЛицо,Биометрия) Экспорт
	РегБиометрия = РегистрыСведений.БиометрическиеДанные.СоздатьНаборЗаписей();
	РегБиометрия.Отбор.ФизЛицо.Установить(ФизЛицо);
	РегБиометрия.Прочитать();
	Если РегБиометрия.Количество()=0 Тогда
		Строка_ = РегБиометрия.Добавить();
	Иначе
		Строка_ = РегБиометрия[0];
	КонецЕсли;

	Строка_.Активность = Истина;
	Строка_.ФизЛицо = ФизЛицо;
	Строка_.Биометрия = Биометрия; 
	
	Попытка
		РегБиометрия.Записать(Истина);
		Результат = Истина;
	Исключение
		Результат = Ложь;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции    


Функция ПолучитьСотрудниковСБиометрией()   Экспорт
	Магазин = ОбменДаннымиПовтИсп.ПолучитьДанныеУзла().Магазин;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	БиометрическиеДанные.ФизЛицо КАК ФизЛицо,
	               |	БиометрическиеДанные.Биометрия КАК Биометрия
	               |ИЗ
	               |	РегистрСведений.БиометрическиеДанные КАК БиометрическиеДанные
	               |ГДЕ
	               |	БиометрическиеДанные.ФизЛицо.Магазин = &Магазин";
	Запрос.УстановитьПараметр("Магазин",Магазин);
	ТаблицаСотрудников = Запрос.Выполнить().Выгрузить();
	
	//АдресТаблицы = ПоместитьВоВременноеХранилище(ТаблицаСотрудников);
	
	Возврат ТаблицаСотрудников;
КонецФункции
